---
type: ElementTypeDuplicatedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementTypeDuplicatedEventArgs

`Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | NewElementTypeId | 2015 | `public ElementId NewElementTypeId { get ; }` |
| Property | NewName | 2015 | `public string NewName { get ; }` |
| Property | OriginalElementTypeId | 2015 | `public ElementId OriginalElementTypeId { get ; }` |